<?php
/*
// 说明: 回访数据统计 .inc
// 作者: 幽兰 (weelia@126.com)
// 时间: 2016-12-02
*/

$yuanqi_kefu_names = explode(" ", "沈卫华 魏安玲 冯丹 张克连 王振亮 刘乔 杨静 张蓉");

$sys_yiyuan_arr = array(
	3 => "九龙男科",
	48 => "新科胃肠科",
	49 => "新科精神科",
	57 => "新科肝病科",
	6 => "新科结石科",
	103 => "新科面瘫科",
	9 => "南浦妇科",
	45 => "江城皮肤",
	12 => "西郊骨科",
	73 => "杭州江城骨科",
	10 => "上海肤康",
	195 => "苏州肤康",
	15 => "上海华美",
	99 => "南京华美",
	89 => "杭州格莱美",
	63 => "南宁中山皮肤",
	81 => "南宁中山精神",
	17 => "南宁中山男科",
	162 => "济南远大",
);

// 后面可以写科室ids，如 3,4,11；也可以写医院名，表示调用医院汇总； 为空则调用自身
$sys_fanwei_set_arr = array(
	3 => "上海九龙男子医院",
	48 => "",
	49 => "",
	57 => "",
	6 => "",
	103 => "",
	9 => "上海南浦医院",
	45 => "上海江城医院",
	12 => "上海西郊骨科医院",
	73 => "杭州江城医院",
	10 => "上海肤康医院",
	195 => "苏州肤康医院",
	15 => "上海华美医院",
	99 => "南京华美医院",
	89 => "杭州格莱美医院",
	63 => "",
	81 => "",
	17 => "",
	162 => "济南远大医院",
);

// 当前用户可看的医院:
$yiyuan_arr = array();
foreach ($sys_yiyuan_arr as $k => $v) {
	if (in_array($k, $hospital_ids)) {
		$yiyuan_arr[$k] = $v;
	}
}

$all_hid_str = @implode(",", array_keys($yiyuan_arr));
if ($all_hid_str == "") $all_hid_str = '0';

// 是否可以维护数据
$is_modify_data = 0;
if ($debug_mode || $uinfo["modify_huifang_count"]) {
	$is_modify_data = 1;
}



?>
